# DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
l = [1,2,3,4,5,6]

In [3]:
l

[1, 2, 3, 4, 5, 6]

In [4]:
pd.DataFrame(l)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [9]:
pd.DataFrame(l, columns = ["variable_name"])

   variable_name
0              1
1              2
2              3
3              4
4              5
5              6

In [10]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [12]:
pd.DataFrame(m, columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [17]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [26]:
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [28]:
df.columns = ("var4","var5","var6")

In [29]:
df

   var4  var5  var6
0     1     2     3
1     4     5     6
2     7     8     9

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var4', 'var5', 'var6'], dtype='object')]

In [34]:
df.ndim

2

In [35]:
df.size

9

In [36]:
df.shape

(3, 3)

In [37]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [38]:
type(df.values)

numpy.ndarray

In [39]:
df.tail(1)

   var4  var5  var6
2     7     8     9

In [40]:
a = np.array([1,2,3,4,5])

In [42]:
pd.DataFrame(a,columns = ["var1"])

   var1
0     1
1     2
2     3
3     4
4     5